"""
1. Напишіть програми, що виконують такі операції з масивами (використовувати
вбудовані методи по роботі з масивами заборонено):
1) виведіть на екран елементи лінійного масиву (заданий користувачем) у
зворотному порядку;
Barbak Vladuslav 122V
"""
import numpy as np # Імпортуємо бібліотеку NumPy
while True: # Цикл створений для запуску програми з початку
    while True:
        try:
         x=int(input('Enter the number of elements: ')) # Введення кількості елементів
         break # Достроково перериває цикл
        except ValueError: # Перехвачує помилку якщо значення x бувка
            print('Input number')
    m=np.zeros(x,dtype=int) # Ініціалізуєм матрицю нулями, і прісваеіваем типу даних тип даних int
    new=[] # Пустий список для подальшого виведення
    for i in range(x): # Проходим по елементах матриці
      m[i] = int(input('Input elements ')) # Вводемо елементи
    for k in range(x): # Знову проходемо по елементах матриці
      l=m[x-1-k] # Присвоюєм елементи масива m із x елементів в зворотньому порядку
      new.append(l) # Добавляємо елементи в зворотньому порядку в пустий список
    print(new) # Виводимо список елементів в зворотньому порядку
    result = input('Want to restart? If yes - 1, No - other: ') # Просимо користуввача ввести 1- для запуску з початку
    if result == '1': # Якщо введене користувачем дорівнює 1, то код запускається з початку
        continue
    else: # Інакше код завершується
        break
