"""
1. Напишіть програми, що виконують такі операції з масивами (використовувати
вбудовані методи по роботі з масивами заборонено):
4) у матриці 4*4, що задана користувачем замініть всі від’ємні елементи на 0.
Barbak Vladuslav 122V
"""
import numpy as np # Імпортуємо бібліотеку NumPy
while True: # Цикл створений для запуску програми з початку
    n,p=int(input('Enter quantity rows matrix:  ')),int(input('Enter quantity column matrix: ')) # Вводемо розмірність матриці
    while n !=4 and p !=4: # Перевірка на розмірність саме 4 на 4
        n,p=int(input('Введите количество рядков:  ')),int(input('Введите количество столбцов: '))
    a=np.zeros((n,p),dtype=int) # Ініціалізуєм матрицю нулями, і прісваеіваем типу даних тип даних int
    for i in range(n): # Проходим ко кожному рядку
        for j in range(p): # Проходим ко кожному стовпцю
            a[i,j]=int(input(f'A[{i+1},{j+1}]=')) # Заповнюємо матрицю значиннями
    print('Your matrix')
    print(a) # Виводемо задану матрицю
    for i in range(n): # Проходим ко кожному рядку
        for j in range(p): # Проходим ко кожному стовпцю
            if a[i,j]<0: # Провірка кожного значення матриці на від'ємне, якщо воно знайдене замінюється на 0
                a[i,j]=0
    print('New matrix')
    print(a) # Виводимо кінцеву матрицю
    result = input('Want to restart? If yes - 1, No - other: ')  # Просимо користуввача ввести 1- для запуску з початку
    if result == '1':  # Якщо введене користувачем дорівнює 1, то код запускається з початку
        continue
    else:  # Інакше код завершується
        break
