"""
2. Задача полягає у вивченні і реалізації алгоритмів пошуку для даних, підготовлених
за допомогою функції моделювання випадкових чисел і текстів, підготовлених
самостійно.
1) лінійний пошук;
Barbak Vladuslav 122V
"""
import numpy as np  # Імпортуємо бібліотеку NumPy
import random  # Імпортуємо бібліотеку Random
while True: # Цикл створений для запуску програми з початку
    mas1 = np.array(range(1, 11))  # Створюємо масив, для перевірки правильності нашого пошуку.
    print(mas1)  # Виводемо створений масив
    x = int(input('Enter the item we are looking for '))  # Якщо користувач введе більше 10, то пошук не буде здійснено
    l = len(mas1)  # Знаходимо довжину масиву
    count = 0  # Лічильник кількості ітерацій і перебору масиву
    p = 0
    while count < l and mas1[count] != x:  # Введемо лінійний пошук
        count += 1
        p += 2  # Лічильник кількості зрівнянь
    print('Number of comparisons', count)
    if count == l:  # Якщо лічильник дорівнює 1, то елемента немає
        print('No item')
    else:  # Інакше елемент найдений на позиції count
        print(f'In position {count} found {x}')
    """
    Робота з рандомними значеннями
    """
    mas2 = np.zeros(10,dtype=int)  # Створюємо масив із 10 ел типу інт ініцалізуваавши їх нулями для перевірки пошуку.
    for i in range(10):  # Перебираєм кожний елемент ряду
        mas2[i] = random.randint(0, 10)  # Кожному елементу присвоюєм випадкове значення в діапазоні від(0,10)
    print(mas2)  # Виводемо створений масив
    l1 = len(mas2)  # Знаходимо довжину масиву
    count2 = 0
    p2 = 0
    while count2 < l and mas2[count2] != x:  # Введемо лінійний пошук
        count2 += 1
        p2 += 2
    print('Number of comparisons', count2)  
    if count2 == l1:  # Якщо лічильник дорівнює 1, то елемента немає
        print('No item')
    else:  # Інакше елемент найдений на позиції count
        print(f'In position {count2} found {x}')
    result = input('Want to restart? If yes - 1, No - other: ')  # Просимо користуввача ввести 1- для запуску з початку
    if result == '1':  # Якщо введене користувачем дорівнює 1, то код запускається з початку
        continue
    else:  # Інакше код завершується
        break
