"""
2. Задача полягає у вивченні і реалізації алгоритмів пошуку для даних, підготовлених
за допомогою функції моделювання випадкових чисел і текстів, підготовлених
самостійно.
3) прямий пошук підрядка.
Barbak Vladuslav 122V
"""
s='Бук бундючивсь перед дубом, тряс над дубом бурим чубом. Дуб пригнув до чуба бука. Буде букові наука'
print(s)
s1=input('Enter a substring ')  # Підстрока не буде найдена,якщо її немає в строці
i=-1  # Індекси строки
j=0  # Індекси підстроки
while (j<len(s1)) and i<(len(s)-len(s1)):
    j=0
    i+=1  # Кількість здвигів, є самою позицією підстроки
    while j<len (s1) and s1[j]==s[i+j]:
        j+=1
if (j==len(s1)):
    print(f'Substring found in position {i},for {i} shifts')
else:
    print('No substring found')
